// b_02_data_type_summary.js

console.clear();

// 형타입!
// 1. 숫자 -> 값을 더하면 계산이 된다.
// 2. 문자 -> 값을 더하면 연결되어 처리된다, 내가 작성할때 ' '안에 내용을 작성한다.
// 3. 논리 -> 내용을 비교(===, !===)하여 맞으면 true, 아니면 false를 도출
// 4. undefined -> 존재는 하지만 값은 없음
// 5. null -> 잘 사용 x
// 6. 객체>배열/객체 -> 배열과 객체로 분리해서 기억
// 6-1. 배열 -> 상세내용 없이 오로지 []안에 목록만 나열
// 6-2. 객체 -> 무엇에는 무엇이 있다(속성명:값)으로 존재하는 정의된 내용을 {} 내부에 나열 (css 작성 내용과 유사)
// 7. 함수 -> 선억식? 표현식? 즉시실행? ... 일단 function(){} 으로 생겼고, 이를 호출하기 위해 이름이 필요
// 7-1. 함수에 이름을 다는 방법은 변수명 = function(){} 으로 처리
// 7-2. 함수에 return이라는게 있는데 최종 결론 도출
// 8. 스코프(범위) -> 변수가 사용할 수 있는 범위 - 전역/지역
